package main

import "fmt"

func main() {

	// 切片嵌套
	// 一维列表
	v1 := []int{11, 22, 33, 44, 55, 66, 77}
	// 二维列表
	v2 := [][]int{[]int{11, 22, 33, 44, 55}, []int{66, 77, 88, 99}}
	// 切片嵌套数组(动态数组，嵌套2个值数组)
	v3 := [][2]int{[2]int{1, 2}, [2]int{3, 4}, [2]int{3, 4}}
	v4 := [][2]int{[2]int{1, 2}, [2]int{3, 4}, [2]int{3, 4}}
	fmt.Println(v1) // [11 22 33 44 55 66 77]
	fmt.Println(v2) // [[11 22 33 44 55] [66 77 88 99]]
	fmt.Println(v3) // [[1 2] [3 4] [3 4]]
	fmt.Println(v4) // [[1 2] [3 4] [3 4]]
	fmt.Println("修改切片嵌套的数据")
	v1[0] = 999
	fmt.Printf("数据类型：%T\n", v1[0]) // 数据类型：int
	v2[0][0] = 999
	fmt.Printf("数据类型：%T\n", v2[0]) // 数据类型：[]int
	v3[1][0] = 999
	fmt.Printf("数据类型：%T\n", v3[1]) // 数据类型：[2]int
	v4[1][1] = 999
	fmt.Printf("数据类型：%T\n", v4[1]) // 数据类型：[2]int
	fmt.Println(v1) // [999 22 33 44 55 66 77]
	fmt.Println(v2) // [[999 22 33 44 55] [66 77 88 99]]
	fmt.Println(v3) // [[1 2] [999 4] [3 4]]
	fmt.Println(v4) // [[1 2] [3 999] [3 4]]

}
